a = ['Цена 1.0 обьем 18904.0 мин обьем 1500.0 грн',
 'Цена 1.0 обьем 32350.0 мин обьем 32000.0 грн',
 'Цена 1.0 обьем 36311.33 мин обьем 500.0 грн',
 'Цена 1.01 обьем 16008.94 мин обьем 2000.0 грн',
 'Цена 1.01 обьем 907.43 мин обьем 916.0 грн',
 'Цена 1.01 обьем 5235.69 мин обьем 4000.0 грн',
 'Цена 1.01 обьем 12733.12 мин обьем 1000.0 грн',
 'Цена 1.01 обьем 77755.91 мин обьем 100.0 грн',
 'Цена 1.01 обьем 445.16 мин обьем 100.0 грн',
 'Цена 1.01 обьем 25500.0 мин обьем 1000.0 грн']
for i in a:
 print(i, end='--')